STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Thread/Thread_Coap_Secure/STM32_WPAN/App/app_thread.c
      }
      provisioning = 1U;
      /* USER CODE END OT_DEVICE_ROLE_CHILD */
      break;
    case OT_DEVICE_ROLE_ROUTER :
      /* USER CODE BEGIN OT_DEVICE_ROLE_ROUTER */
      BSP_LED_Off(LED2);
      BSP_LED_On(LED3);
      /* USER CODE END OT_DEVICE_ROLE_ROUTER */
      break;
    case OT_DEVICE_ROLE_LEADER :
      /* USER CODE BEGIN OT_DEVICE_ROLE_LEADER */
      BSP_LED_On(LED2);
      BSP_LED_Off(LED3);
      /* USER CODE END OT_DEVICE_ROLE_LEADER */
      break;
    default:
      /* USER CODE BEGIN DEFAULT */
      BSP_LED_Off(LED2);
      BSP_LED_Off(LED3);
      /* USER CODE END DEFAULT */
      break;
    }
  }
}

/**
  * @brief  Warn the user that an error has occurred.In this case,
  *         the LEDs on the Board will start blinking.
  *
  * @param  pMess  : Message associated to the error.
  * @param  ErrCode: Error code associated to the module (OpenThread or other module if any)
  * @retval None
  */
static void APP_THREAD_TraceError(const char * pMess, uint32_t ErrCode)
{
  /* USER CODE BEGIN TRACE_ERROR */
  APP_DBG("**** Fatal error = %s (Err = %d)", pMess, ErrCode);
  while(1U == 1U)
  {
    BSP_LED_Toggle(LED1);
    HAL_Delay(500U);
    BSP_LED_Toggle(LED2);
    HAL_Delay(500U);
    BSP_LED_Toggle(LED3);
    HAL_Delay(500U);
  }
  /* USER CODE END TRACE_ERROR */
}

/**
 * @brief Check if the Coprocessor Wireless Firmware loaded supports Thread
 *        and display associated information
 * @param  None
 * @retval None
 */
static void APP_THREAD_CheckWirelessFirmwareInfo(void)
{
  WirelessFwInfo_t wireless_info_instance;
  WirelessFwInfo_t* p_wireless_info = &wireless_info_instance;

  if (SHCI_GetWirelessFwInfo(p_wireless_info) != SHCI_Success)
  {
    APP_THREAD_Error((uint32_t)ERR_THREAD_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
  }
  else
  {
    APP_DBG("**********************************************************");
    APP_DBG("WIRELESS COPROCESSOR FW:");
    /* Print version */
    APP_DBG("VERSION ID = %d.%d.%d", p_wireless_info->VersionMajor, p_wireless_info->VersionMinor, p_wireless_info->VersionSub);

    switch(p_wireless_info->StackType)
    {
    case INFO_STACK_TYPE_THREAD_FTD :
      APP_DBG("FW Type : Thread FTD");
      break;
    case INFO_STACK_TYPE_THREAD_MTD :
      APP_DBG("FW Type : Thread MTD");
      break;
    case INFO_STACK_TYPE_BLE_THREAD_FTD_STATIC :
      APP_DBG("FW Type : Static Concurrent Mode BLE/Thread");
      break;
    default :
      /* No Thread device supported ! */
      APP_THREAD_Error((uint32_t)ERR_THREAD_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
      break;
    }
    APP_DBG("**********************************************************");
  }
}
/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
/**
 * @brief This function is used to manage the APP_THREAD_AskProvisioning request
 *
 * @param None
 * @retval None
 */
static void APP_THREAD_ProvisioningReqSend()
{
  static uint8_t l_PayloadWrite = 1;
  APP_DBG("STEP 1: APP_THREAD_ProvisioningReqSend : Send a CoAP CONFIRMABLE GET Request");
  /* Send a CONFIRMABLE GET Request */
  APP_THREAD_CoapSendRequest(&OT_RessourceProvisionning,
      OT_COAP_TYPE_CONFIRMABLE,
      OT_COAP_CODE_GET,
      MULICAST_FTD_MED,
      NULL,
      &l_PayloadWrite,
      sizeof(l_PayloadWrite),
      &APP_THREAD_ProvisioningRespHandler,
      NULL);
}

/**
 * @brief This function is used to manage the APP_THREAD_AskProvisioning response
 *    handler.
 *
 * @param pContext context
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @param Result error code if any
 * @retval None
 */
static void APP_THREAD_ProvisioningRespHandler(
    void                * pContext,
    otMessage           * pMessage,
    const otMessageInfo * pMessageInfo,
    otError             Result)
{
  static uint8_t resp_index = 0;

  if (Result == OT_ERROR_NONE)
  {
    APP_DBG("STEP 4: Response received");
    uint16_t l_number_bytes_read = otMessageRead(pMessage, otMessageGetOffset(pMessage), &OT_Command, sizeof(OT_Command));
    APP_DBG("l_number_bytes_read = %d", l_number_bytes_read);

    if (l_number_bytes_read == sizeof(OT_Command))
    {
      /* Retrieve the peer address */
      if (otMessageRead(pMessage,
          otMessageGetOffset(pMessage) + sizeof(OT_Command),
          &OT_PeerAddress,
          sizeof(OT_PeerAddress)) != sizeof(OT_PeerAddress))
      {
        APP_THREAD_Error(ERR_READ, 0);
      }
      APP_DBG("resp_index = %d", resp_index);
      resp_index++;
      APP_DBG("IPv6 address of remote server retrieved!!!");
 
    }
    else
    {
      APP_DBG("**** WARNING: APP_THREAD_ProvisioningRespHandler read 0 byte ! *****");
    }
  }
  else
  {
    APP_DBG("**** APP_THREAD_ProvisioningRespHandler failed ***** with ERROR code = %d ", Result);
  }
}

/**
 * @brief This function is used to handle the APP_THREAD_AskProvisioning handler
 *
 * @param pContext : Context
 * @param pHeader header pointer
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @retval None
 */
static void APP_THREAD_ProvisioningReqHandler(void                * pContext,
                                              otMessage           * pMessage,
                                              const otMessageInfo * pMessageInfo)
{
  APP_DBG("STEP 2: Receives Provisioning request");
  if (otCoapMessageGetType(pMessage) == OT_COAP_TYPE_CONFIRMABLE)
  {
    if (APP_THREAD_ProvisioningRespSend(pMessage, pMessageInfo) != OT_ERROR_NONE)
    {
      APP_THREAD_Error(ERR_PROVISIONING_RESP, 0);
    }
  }
}

/**
 * @brief This function is used to handle the APP_THREAD_AskProvisioning response
 *
 * @param pRequestHeader
 * @param pMessageInfo message info pointer
 * @retval error code
 */
static otError APP_THREAD_ProvisioningRespSend(otMessage    * pMessage,
    const otMessageInfo * pMessageInfo)
{
  otError  error = OT_ERROR_NONE;
  do{
    APP_DBG("STEP 3: Provisioning Send Response");

    pOT_MessageResponse = otCoapNewMessage(NULL, NULL);
    if (pOT_MessageResponse == NULL)
    {
      APP_DBG("WARNING : pOT_MessageResponse = NULL ! -> exit now");
      break;
    }

