STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Thread/Thread_Coap_Secure/STM32_WPAN/App/app_thread.c
    otCoapMessageInitResponse(pOT_MessageResponse,
        pMessage,
        OT_COAP_TYPE_ACKNOWLEDGMENT,
        OT_COAP_CODE_CHANGED);

    error = otCoapSecureSendResponse(NULL, pOT_MessageResponse, pMessageInfo);
    if (error != OT_ERROR_NONE && pOT_MessageResponse != NULL)
    {
      otMessageFree(pOT_MessageResponse);
      APP_THREAD_Error(ERR_THREAD_COAP_DATA_RESPONSE,error);
    }
  }while(false);
}

/**
 * @brief This function manages the data response handler.
 *
 * @param pHeader  context
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @param result error code
 * @retval None
 */
static void APP_THREAD_CoapDataRespHandler(
    void                * pContext,
    otMessage           * pMessage,
    const otMessageInfo * pMessageInfo,
    otError               result)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(pMessage);
  UNUSED(pMessageInfo);

  if (result == OT_ERROR_NONE)
  {
    APP_DBG("APP_THREAD_CoapDataRespHandler : NO ERROR");
  }
  else
  {
    APP_DBG("APP_THREAD_CoapDataRespHandler : WARNING Result = %d",result);
  }
}

/**
 * @brief Initialize CoAP write buffer.
 * @param  None
 * @retval None
 */
static void APP_THREAD_InitPayloadWrite(void)
{
  uint8_t i;
  for(i = 0; i < COAP_PAYLOAD_LENGTH; i++)
  {
    PayloadWrite[i] = 0xFF;
  }
}

/**
 * @brief Send a CoAP Secure request with defined parameters.
 *
 * @param[in]  aCoapRessource   A pointer to a otCoapResource.
 * @param[in]  aCoapType        otCoapType.
 * @param[in]  aCoapCode        otCoapCode.
 * @param[in]  aPayload         A pointer to payload.
 * @param[in]  aHandler         A pointer to CoAP response handler.
 *
 * @retval none.
 */
static void APP_THREAD_CoapSecureSendRequest(otCoapResource* aCoapRessource,
    otCoapType aCoapType,
    otCoapCode aCoapCode,
    uint8_t* aPayload,
    uint16_t Size,
    otCoapResponseHandler aHandler)
{
  otError error = OT_ERROR_NONE;

  do{
    pOT_Message = otCoapNewMessage(NULL, NULL);
    if (pOT_Message == NULL)
    {
      APP_THREAD_Error(ERR_THREAD_COAP_NEW_MSG,error);
      break;
    }

    otCoapMessageInit(pOT_Message, aCoapType, aCoapCode);
    otCoapMessageAppendUriPathOptions(pOT_Message, aCoapRessource->mUriPath);
    otCoapMessageSetPayloadMarker(pOT_Message);

    if((aPayload != NULL) && (Size > 0))
    {
      error = otMessageAppend(pOT_Message, aPayload, Size);
      if (error != OT_ERROR_NONE)
      {
        APP_THREAD_Error(ERR_THREAD_COAP_APPEND,error);
        break;
      }
    }
    else
    {
      APP_DBG("APP_THREAD_CoapSendRequest: No payload passed");
    }

    if ((aCoapType == OT_COAP_TYPE_CONFIRMABLE) || (aCoapCode == OT_COAP_CODE_GET))
    {
      error = otCoapSecureSendRequest(NULL,
          pOT_Message,
          aHandler,
          "COAP_SECURE_CONTEXT_CONFIRMABLE");
    }
    else
    {
      error = otCoapSecureSendRequest(NULL,
          pOT_Message,
          NULL,
          "COAP_SECURE_CONTEXT_NON_CONFIRMABLE");
    }
  }while(false);
  if (error != OT_ERROR_NONE && pOT_Message != NULL)
  {
    otMessageFree(pOT_Message);
    APP_THREAD_Error(ERR_THREAD_COAP_SEND_REQUEST,error);
  }
}

/**
 * @brief Task associated to the push button.
 * @param  None
 * @retval None
 */
static void APP_THREAD_SendCoapSecureMsg(void)
{
  otError error = OT_ERROR_NONE;
  otSockAddr sockaddr;

  APP_DBG("CoAP Secure connect to server");

  sockaddr.mPort = OT_DEFAULT_COAP_SECURE_PORT;
  memcpy(&sockaddr.mAddress, &OT_PeerAddress, sizeof(OT_PeerAddress));
  error = otCoapSecureConnect(NULL, &sockaddr, APP_THREAD_CoapSecureConnected, "ContextSecure");
  if (error != OT_ERROR_NONE)
  {
    APP_DBG("ERROR : otCoapSecureConnect failed!");
    APP_THREAD_Error(ERR_THREAD_COAP_SECURE_CONNECT,error);
  }

  UTIL_SEQ_WaitEvt(EVENT_COAP_SECURE_CONNECT);

  APP_DBG("CoAP Secure connected so start data transfer");

  APP_DBG("Send a CoAP Secure NON-CONFIRMABLE PUT Request");
  APP_THREAD_CoapSecureSendRequest(&OT_RessourceSecure,
      OT_COAP_TYPE_NON_CONFIRMABLE,
      OT_COAP_CODE_PUT,
      PayloadWrite,
      sizeof(PayloadWrite),
      NULL);

  /* Insert Delay here using Hw timer server */
  /* Start the timer */
  HW_TS_Start(TimerID, (uint32_t)WAIT_TIMEOUT);
  UTIL_SEQ_WaitEvt(EVENT_TIMER);

  APP_DBG("Send a CoAP Secure CONFIRMABLE PUT Request");
  APP_THREAD_CoapSecureSendRequest(&OT_RessourceSecure,
      OT_COAP_TYPE_CONFIRMABLE,
      OT_COAP_CODE_PUT,
      PayloadWrite,
      sizeof(PayloadWrite),
      APP_THREAD_CoapDataRespHandler);
}

static void APP_THREAD_TimingElapsed(void)
{
  APP_DBG("--- APP_THREAD_TimingElapsed ---");
  UTIL_SEQ_SetEvt(EVENT_TIMER);
}

/**
 * @brief  Compare the message received versus the original message.
 * @param  None
 * @retval None
 */
static bool APP_THREAD_CheckMsgValidity(void)
{
  bool valid = true;
  uint32_t i;

  for(i = 0; i < COAP_PAYLOAD_LENGTH; i++)
  {
    if(PayloadRead[i] != PayloadWrite[i])
    {
      valid = false;
    }
  }

  if(valid == true)
  {
    APP_DBG("PAYLOAD Comparison OK!");
  }else
  {
    APP_THREAD_Error(ERR_THREAD_MSG_COMPARE_FAILED, 0);
  }
  return valid;
}
/* USER CODE END FD_LOCAL_FUNCTIONS */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

void APP_THREAD_RegisterCmdBuffer(TL_CmdPacket_t* p_buffer)
{
  p_thread_otcmdbuffer = p_buffer;
}

Thread_OT_Cmd_Request_t* THREAD_Get_OTCmdPayloadBuffer(void)
{
  return (Thread_OT_Cmd_Request_t*)p_thread_otcmdbuffer->cmdserial.cmd.payload;
}

Thread_OT_Cmd_Request_t* THREAD_Get_OTCmdRspPayloadBuffer(void)
{
  return (Thread_OT_Cmd_Request_t*)((TL_EvtPacket_t *)p_thread_otcmdbuffer)->evtserial.evt.payload;
}

Thread_OT_Cmd_Request_t* THREAD_Get_NotificationPayloadBuffer(void)
{
  return (Thread_OT_Cmd_Request_t*)(p_thread_notif_M0_to_M4)->evtserial.evt.payload;
}

static void Ot_Cmd_Transfer_Common(void)
{
  /* OpenThread OT command cmdcode range 0x280 .. 0x3DF = 352 */
  p_thread_otcmdbuffer->cmdserial.cmd.cmdcode = 0x280U;
  /* Size = otCmdBuffer->Size (Number of OT cmd arguments : 1 arg = 32bits so multiply by 4 to get size in bytes)
   * + ID (4 bytes) + Size (4 bytes) */
  uint32_t l_size = ((Thread_OT_Cmd_Request_t*)(p_thread_otcmdbuffer->cmdserial.cmd.payload))->Size * 4U + 8U;
  p_thread_otcmdbuffer->cmdserial.cmd.plen = l_size;

  TL_OT_SendCmd();

